
## Plan Result (system_a)

[CI link](https://github.com/nangashi/dcr/actions/runs/7370902675)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 3 to destroy.</code></pre>

* Create
  * module.monthly_aggregate.local_file.archive_plan[0]
* Update
  * module.monthly_aggregate.aws_lambda_function.this[0]
* Replace
  * module.monthly_aggregate.aws_s3_object.lambda_package[0]
  * module.monthly_aggregate.null_resource.archive[0]
  * module.monthly_aggregate.null_resource.sam_metadata_aws_lambda_function[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.monthly_aggregate.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "MonthlyAggregate-prd"
      ~ last_modified                  = "2023-12-30T23:42:03.000+0000" -> (known after apply)
      ~ s3_key                         = "monthly_aggregate/ea5821c34663e7c7e33500304c48a52208b0ef73ebe5b3e1810f510ac9815382.zip" -> "monthly_aggregate/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
      ~ s3_object_version              = "1mJ3I9G3qjoxjeWkbuKUuS56FR5JOkrh" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.monthly_aggregate.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "8cc8524f7976190499c1ab3f71db2f21" -> (known after apply)
      ~ id                     = "monthly_aggregate/ea5821c34663e7c7e33500304c48a52208b0ef73ebe5b3e1810f510ac9815382.zip" -> (known after apply)
      ~ key                    = "monthly_aggregate/ea5821c34663e7c7e33500304c48a52208b0ef73ebe5b3e1810f510ac9815382.zip" -> "monthly_aggregate/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "builds/ea5821c34663e7c7e33500304c48a52208b0ef73ebe5b3e1810f510ac9815382.zip" -> "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
      - tags                   = {} -> null
      ~ version_id             = "1mJ3I9G3qjoxjeWkbuKUuS56FR5JOkrh" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.monthly_aggregate.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/monthly_aggregate/src/",
                      + null,
                    ],
                ]
              + filename      = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
              + runtime       = "python3.9"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.plan.json"
      + id                   = (known after apply)
    }

  # module.monthly_aggregate.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6213125000275560016" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ea5821c34663e7c7e33500304c48a52208b0ef73ebe5b3e1810f510ac9815382.zip" -> "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
          ~ "timestamp" = "1703979702551434000" -> "1704031515139045000"
        }
    }

  # module.monthly_aggregate.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4759618651578567322" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/ea5821c34663e7c7e33500304c48a52208b0ef73ebe5b3e1810f510ac9815382.zip" -> "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 4 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":39,"Program":"tfcmt","SHA1":"3d54db10d1cbbb4a46d047c4b76fc6827b3742bd","Target":"system_a","Vars":{},"WorkflowName":"Check Pull Requests"} -->